Repository: Centaur/lua-nginx-module
Catalog: omegat/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: To terminate the current request from within a [[#access_by_lua|access_by_lua]] handler, calling [[#ngx.exit|ngx.exit]] with status >= 200 (<code>ngx.HTTP_OK</code>) and status < 300 (<code>ngx.HTTP_SPECIAL_RESPONSE</code>) for successful quits and <code>ngx.exit(ngx.HTTP_INTERNAL_SERVER_ERROR)</code> (or its friends) for failures.
zh_cn: 要在 [[#access_by_lua|access_by_lua]] 处理器中终止请求处理, 如果是成功退出，要调用 [[#ngx.exit|ngx.exit]]将状态码设置为 >= 200 (<code>ngx.HTTP_OK</code>) < 300 (<code>ngx.HTTP_SPECIAL_RESPONSE</code>) 的值，如果是失败退出调用 <code>ngx.exit(ngx.HTTP_INTERNAL_SERVER_ERROR)</code> (或类似的值).

source: To terminate the current request from within a [[#rewrite_by_lua|rewrite_by_lua]] handler, calling [[#ngx.exit|ngx.exit]] with status >= 200 (<code>ngx.HTTP_OK</code>) and status < 300 (<code>ngx.HTTP_SPECIAL_RESPONSE</code>) for successful quits and <code>ngx.exit(ngx.HTTP_INTERNAL_SERVER_ERROR)</code> (or its friends) for failures.
zh_cn: To terminate the current request from within a 要在 [[#rewrite_by_lua|rewrite_by_lua]] handler中终止请求处理, 如果是成功退出，要调用 [[#ngx.exit|ngx.exit]]将状态码设置为 >= 200 (<code>ngx.HTTP_OK</code>) < 300 (<code>ngx.HTTP_SPECIAL_RESPONSE</code>) 的值，如果是失败退出调用 <code>ngx.exit(ngx.HTTP_INTERNAL_SERVER_ERROR)</code> (或类似的值).

source: U similar to "u" but disables PCRE's UTF-8 validity check on
zh_cn: U 类似于 "u" 但禁止 PCRE 对目标字符串进行UTF-8校验

source: URI arguments can be specified as well, for example:
zh_cn: 也可以指定URI参数URI, 例如:

source: URI query strings can be concatenated to URI itself, for instance,
zh_cn: URI query string可以被添加到URI本身 如,

source: Unconditionally removes the key-value pair from the shm-based dictionary [[#ngx.shared.DICT|ngx.shared.DICT]].
zh_cn: 从基于共享内存的字典[[#ngx.shared.DICTngx.shared.DICT]]中无条件删除key-value对.

source: Unconditionally sets a key-value pair into the shm-based dictionary [[#ngx.shared.DICT|ngx.shared.DICT]].
zh_cn: 无条件向基于共享内存的字典 [[#ngx.shared.DICTngx.shared.DICT]]中写入一个key-value对.

source: Underscores (<code>_</code>) in the header names will also be replaced by dashes (<code>-</code>) and the header names will be matched case-insensitively.
zh_cn: 同样，头名称中的下划线 (<code>_</code>) 将被替换成减号 (<code>-</code>) ，头名称的匹配是大小写无关的。

source: Underscores (<code>_</code>) in the header names will be replaced by hyphens (<code>-</code>) by default.
zh_cn: 默认会将头名称中的下划线(<code>_</code>) 换成减号 (<code>-</code>) .

source: Unescape <code>str</code> as an escaped URI component.
zh_cn: 将URI片段 <code>str</code> 解转义.

source: Unlike [http://httpd.apache.org/docs/2.3/mod/mod_lua.html Apache's mod_lua] and [http://redmine.lighttpd.net/wiki/1/Docs:ModMagnet Lighttpd's mod_magnet], Lua code executed using this module can be ''100% non-blocking'' on network traffic as long as the [[#Nginx API for Lua|Nginx API for Lua]] provided by this module is used to handle requests to upstream services such as MySQL, PostgreSQL, Memcached, Redis, or upstream HTTP web services.
zh_cn: 与[http://httpd.apache.org/docs/2.3/mod/mod_lua.html Apache's mod_lua] 和 [http://redmine.lighttpd.net/wiki/1/Docs:ModMagnet Lighttpd's mod_magnet] 不同, 只要使用[[#Nginx API for Lua|Nginx API for Lua]]来处理到upstream服务如MySQL，PostgreSQL，Memcached, Redis或upstream web service的请求, 使用本模块运行的Lua代码在处理网络请求时可以是 ''100% 非阻塞的''。

source: Unlike as with LuaJIT, debug information is included in standard Lua 5.1 bytecode files by default.
zh_cn: 与LuaJIT不同, 标准 Lua 5.1 字节码文件中默认就携带调试信息.

source: Unlike the [[#ngx.shared.DICT.flush_all|flush_all]] method, this method actually free up the memory used by the expired items.
zh_cn: 与 [[#ngx.shared.DICT.flush_all|flush_all]] 不同, 本方法会事实上释放已过期项目占用的内存.

source: Unmatched subpatterns will have <code>nil</code> values in their <code>captures</code> table fields.
zh_cn: 没有匹配上的子模板在<code>captures</code> table中的值为<code>nil</code>.

source: Updates of the Nginx time cache an be forced by calling [[#ngx.update_time|ngx.update_time]] first.
zh_cn: 可以先用[[#ngx.update_timengx.update_time]]强制刷新Nginx时间缓存.

source: Updating query arguments via the nginx variable <code>$args</code> (or <code>ngx.var.args</code> in Lua) at runtime is also supported:
zh_cn: 还支持在运行时用ngxin变量 <code>$args</code> (或Lua <code>ngx.var.args</code> )来更新请求参数:

source: Use normal locations combined with the <code>internal</code> directive to prepare internal-only locations.
zh_cn: 对普通的location使用 <code>internal</code> 命令来准备只作内部使用的location.

source: Use of jump in other contexts is prohibited and will throw out a Lua exception.
zh_cn: 在其它的上下文中使用jump是被禁止的，会抛出Lua异常。

source: Use of the [http://www.lua.org/manual/5.1/manual.html#pdf-package.seeall package.seeall] flag is strongly discouraged due to its various bad side-effects.
zh_cn: 由于其所带来的各种不好的负作用，强烈不推荐使用 [http://www.lua.org/manual/5.1/manual.html#pdf-package.seeall package.seeall] 标记。

source: Use the [[#ngx.req.get_post_args|ngx.req.get_post_args]] function instead if a Lua table is required.
zh_cn: 如果需要Lua table请使用[[#ngx.req.get_post_args|ngx.req.get_post_args]] 函数.

source: User "light threads" can create "light threads" themselves and normal user coroutiens created by [[#coroutine.create|coroutine.create]] can also create "light threads".
zh_cn: 用户 "轻量线程" 自己也可以创建 "轻量线程" , 由 [[#coroutine.createcoroutine.create]]创建的普通用户coroutine也可以创建"轻量线程".

source: Uses Lua code specified in <code><lua-script-str></code> to define an output body filter.
zh_cn: 用 <code><lua-script-str></code> 中的代码来定义一个输出体过滤器。

source: Uses Lua code specified in <code><lua-script-str></code> to define an output header filter.
zh_cn: 用 <code><lua-script-str></code> 中的代码来定义一个输出头过滤器。

source: Usually you can register (true) Lua global variables or pre-load Lua modules at server start-up by means of this hook.
zh_cn: 通常你可以使用这个hook在服务器启动时来注册（真正的）Lua全局变量 或预加载Lua模块。

source: Waits on one or more child "light threads" and returns the results of the first "light thread" that terminates (either successfully or with an error).
zh_cn: 等待一个或多个子 "轻量线程" 并返回第一个结束(成功或出错)的 "轻量线程" 的结果 .

source: We can also use the numerical code directly as the second <code>status</code> argument:
zh_cn: 我们也可以直接在 <code>status</code> 参数中使用数字状态码:

source: When <code>ngx.flush(true)</code> is called immediately after [[#ngx.print|ngx.print]] or [[#ngx.say|ngx.say]], it causes the latter functions to run in synchronous mode.
zh_cn: 如果在[[#ngx.printngx.print]] 或 [[#ngx.sayngx.say]]之后立即调用 <code>ngx.flush(true)</code> , 将导致前者运行于同步模式。

source: When <code>status == 0</code> (i.e., <code>ngx.OK</code>), it will only quit the current phase handler (or the content handler if the [[#content_by_lua|content_by_lua]] directive is used) and continue to run later phases (if any) for the current request.
zh_cn: 如果<code>status == 0</code> (即, <code>ngx.OK</code>), 将只退出当前的阶段处理器 ( 如果使用了[[#content_by_luacontent_by_lua]]，则是当前的内容处理器)，会继续执行当前请求的后续阶段（如果有的话）。

source: When <code>status >= 200</code> (i.e., <code>ngx.HTTP_OK</code> and above), it will interrupt the execution of the current request and return status code to nginx.
zh_cn: 如果 <code>status >= 200</code> (即, <code>ngx.HTTP_OK</code> 及以上), 它将中断当前请求的执行直接将状态码返回给nginx.

source: When Nginx receives the <code>HUP</code> signal and starts reloading the config file, the Lua VM will also be re-created and <code>init_by_lua</code> will run again on the new Lua VM.
zh_cn: 如果 Nginx 收到<code>HUP</code> 信号，开始重新加载配置文件, Lua虚拟机将被重新创建， <code>init_by_lua</code>会在新的Lua虚拟机中被重新运行。

source: When TCP keepalive is disabled, it is relying on the client side to close the socket gracefully (by sending a <code>FIN</code> packet or something like that).
zh_cn: 如果TCP keepalive被禁止, 需要依赖客户端来完美地关闭socket (发送 <code>FIN</code> 或类似的包).

source: When [[#lua_check_client_abort|lua_check_client_abort]] is set to <code>off</code> (which is the default), then this function call will always return the error message "lua_check_client_abort is off".
zh_cn: 如果[[#lua_check_client_abort|lua_check_client_abort]] 设为 <code>off</code> (这是默认值), 则此函数总是返回错误信息 "lua_check_client_abort is off".

source: When a match is found, a Lua table <code>captures</code> is returned, where <code>captures[0]</code> holds the whole substring being matched, and <code>captures[1]</code> holds the first parenthesized sub-pattern's capturing, <code>captures[2]</code> the second, and so on.
zh_cn: 如果有匹配，返回 Lua table <code>captures</code> , 其中 <code>captures[0]</code> 装有匹配到的整个子串, <code>captures[1]</code> 装有第一个对第一个括号子模板的捕捉结果, <code>captures[2]</code> 装有第二个，依此类推.

source: When a relative path like <code>foo/bar.lua</code> is given, they will be turned into the absolute path relative to the <code>server prefix</code> path determined by the <code>-p PATH</code> command-line option while starting the Nginx server.
zh_cn: 如果指定的是相对路径如 <code>foo/bar.lua</code> , 它们将被加上 <code>server prefix</code> 转换成绝对路径。<code>server prefix</code>可由在Nginx服务器启动时使用<code>-p PATH</code> 命令行参数来得到。

source: When a timer expires, the user Lua code in the timer callback is running in a "light thread" detached completely from the original request creating the timer.
zh_cn: 当定时器过期时, 定时器回调函数中的用户Lua代码将在一个与创建定时器的请求脱离的"轻量线程"中运行.

source: When called with the default argument, it issues an asynchronous call (Returns immediately without waiting for output data to be written into the system send buffer).
zh_cn: 当用默认参数调用时, 会发起一个异步调用 (立即返回， 不需要等待所有数据被写进系统发送缓冲区).

source: When called without any argument, the iterator function returns the received data right ''before'' the specified pattern string in the incoming data stream.
zh_cn: 如果不加任何参数调用iterator函数，它将返回输入数据流中在指定的模式字符串 ''之前'' 的数据.

source: When exceeding this limit, Nginx will stop running the callbacks of newly expired timers and log an error message "N lua_max_running_timers are not enough" where "N" is the current value of this directive.
zh_cn: 当数量超限时，, Nginx将停止运行最新过期的定时器并记录错误日志消息 "N lua_max_running_timers are not enough" ，其中 "N" 是本命令当前所设置的值。

source: When exceeding this limit, the [[#ngx.timer.at|ngx.timer.at]] call will immediately return <code>nil</code> and the error string "too many pending timers".
zh_cn: 当定时器数量超限时, [[#ngx.timer.at|ngx.timer.at]] 调用将立即返回 <code>nil</code> 和错误信息 "too many pending timers".

source: When it fails to allocate memory for the current key-value item, then <code>set</code> will try removing existing items in the storage according to the Least-Recently Used (LRU) algorithm.
zh_cn: 如果为当前的键－值对项分配内存失败, <code>set</code> 将尝试用LRU算法从存储区删除某些已经存在的项.

source: When match fails, the <code>ctx</code> table will be left intact.
zh_cn: 如果匹配失败, <code>ctx</code> table将不变.

source: When setting <code>nil</code> or an empty Lua string value to <code>ngx.arg[1]</code>, no data chunk will be passed to the downstream Nginx output filters at all.
zh_cn: 如果将<code>ngx.arg[1]</code>设置成 <code>nil</code> 或空的Lua string , 将不会有数据发往下游 Nginx输出过滤器。

source: When setting the limit to 0, the default "match limit" when compiling the PCRE library is used.
zh_cn: 如果此值设为0, 将使用编译 PCRE 库时的默认“match limit”值.

source: When the <code><max_count></code> argument is given the value <code>0</code>, then all the keys will be returned even there is more than 1024 keys in the dictionary.
zh_cn: 如果 <code><max_count></code> 参数是值是 <code>0</code>, 即使有多于1024项，也全部返回.

source: When the <code>body</code> option is not specified, the <code>POST</code> and <code>PUT</code> subrequests will inherit the request bodies of the parent request (if any).
zh_cn: 如果没有指定 <code>body</code> 选项， <code>POST</code> 和 <code>PUT</code> 子请求将从父请求中继承请求体(如果有的话).

source: When the <code>header_value</code> argument is <code>nil</code>, the request header will be removed.
zh_cn: 如果 <code>header_value</code> 参数是<code>nil</code>, 这个请求头将被删除.

source: When the <code>max_count</code> argument is given <code>0</code> or not given at all, then it means unlimited.
zh_cn: 如果 <code>max_count</code> 参数没有或是 <code>0</code>, 那就是清除所有的.

source: When the <code>pos</code> field in the <code>ctx</code> table argument is specified, <code>ngx.re.match</code> will start matching from that offset.
zh_cn: 如果<code>ctx</code> table中指定了 <code>pos</code>，则 <code>ngx.re.match</code> 将从这个位置开始匹配 .

source: When the <code>replace</code> argument is of type "function", then it will be invoked with the "match table" as the argument to generate the replace string literal for substitution.
zh_cn: 如果 <code>replace</code> 参数的类型是 "函数", 则它会作用于 "匹配结果table" 生成替换后的字符串.

source: When the <code>replace</code> is a string, then it is treated as a special template for string replacement.
zh_cn: 如果 <code>replace</code> 是航空器, 则它将被用作字符串替换的特殊模板.

source: When the Lua code cache is turned on (by default), the user code is loaded once at the first request and cached and the Nginx config must be reloaded each time the Lua source file is modified.
zh_cn: 如果Lua代码缓存被打开 (这是默认行为), 用户代码在第一个请求中被加载并缓存，每次Lua代码文件被修改后，需要重新加载Nginx配置文件。

source: When the Lua code may change the length of the response body, then it is required to always clear out the <code>Content-Length</code> response header (if any) in a header filter to enforce streaming output, as in
zh_cn: 如果Lua 代码可能改变响应体的长度, 就总是需要用头过滤器来清除 <code>Content-Length</code> 响应头 (如果有的话)来保证流输出的正确性, 例如

source: When the Nginx worker is trying to shut down, one can no longer call <code>ngx.timer.at</code> to create new timers and in that case <code>ngx.timer.at</code> will return <code>nil</code> and a string describing the error, that is, "process exiting".
zh_cn: 当Nginx worker进程尝试关闭时，不能再调用 <code>ngx.timer.at</code> 创建新的定时器，<code>ngx.timer.at</code> 将返回<code>nil</code> 及错误字符串 "process exiting".

source: When the connection pool exceeds the available size limit, the least recently used (idle) connection already in the pool will be closed to make room for the current connection.
zh_cn: 当连接池使用超限时, 池中最不经常使用的 (空闲) 连接将被关闭，为当前连接腾出空间。

source: When the current request's request body has been read into memory or buffered into a disk file, then the old request body's memory will be freed or the disk file will be cleaned up immediately, respectively.
zh_cn: 如果当前请求的请求体已经被读入内存，则旧的请求体内存将被释放；如果已经被读入磁盘文件，则此文件将被立即删除。

source: When the data can no longer be hold in the memory buffer for the request body, then the data will be flushed onto a temporary file just like the standard request body reader in the Nginx core.
zh_cn: 当请求体数据不再能保留在内存中时，数据将被写到一个临时文件里，就象Nginx核心中的标准请求体读取器一样.

source: When the limit is hit, the error string "pcre_exec() failed: -8" will be returned by the [[#ngx.re.match|ngx.re API]] functions on the Lua land.
zh_cn: 当达到这个上限时, 在Lua一方，[[#ngx.re.matchngx.re API]]会返回 "pcre_exec() failed: -8" 错误信息。

source: When the user "light thread" terminates with a Lua error, however, it will not abort other running "light threads" like the "entry thread" does.
zh_cn: 但是如果用户 "轻量线程" 由于Lua错误而终止， 它不会象"入口线程"那样导致其它正在运行的 "轻量线程" 被中断.

source: When this argument is omitted, the default setting in the [[#lua_socket_pool_size|lua_socket_pool_size]] config directive will be used.
zh_cn: 如果没有这个参数，将使用 [[#lua_socket_pool_size|lua_socket_pool_size]] 配置命令中的默认设置.

source: When this directive is turned on, the ngx_lua module will monitor the premature connection close event on the downstream connections.
zh_cn: 如果本命令被打开， ngx_lua 模块将监视下游连接的过早连接关闭事件。

source: When this is used in the context of the [[#set_by_lua|set_by_lua]] or [[#set_by_lua_file|set_by_lua_file]] directives, this table is read-only and holds the input arguments to the config directives:
zh_cn: 如果被用于 [[#set_by_lua|set_by_lua]] 或 [[#set_by_lua_file|set_by_lua_file]] 命令的上下文中, 这个table是只读的，装有配置命令的输入参数:

source: When this limit is exceeded, the following error message is added to the <code>error.log</code> file:
zh_cn: 如果超限， <code>error.log</code> 文件中将记录以下错误日志:

source: When this table is used in the context of [[#body_filter_by_lua|body_filter_by_lua]] or [[#body_filter_by_lua_file|body_filter_by_lua_file]], the first element holds the input data chunk to the output filter code and the second element holds the boolean flag for the "eof" flag indicating the end of the whole output data stream.
zh_cn: 如果在 [[#body_filter_by_lua|body_filter_by_lua]] 或 [[#body_filter_by_lua_file|body_filter_by_lua_file]]中使用这个table, 第一个元素保存的是发给输出过滤器的数据块，第二个元素保存的是标记整个输出数据流"eof"的boolean值。

source: When this timeout reaches, idle connections will be closed and removed from the pool.
zh_cn: 如果超时, 空闲的连接将被关闭并从池中删除。

source: When you disable the HTTP 1.1 keep-alive feature for your downstream connections, you can rely on descent HTTP clients to close the connection actively for you when you call this method.
zh_cn: 如果对下游连接禁止了HTTP 1.1 keep-alive功能, 可以使用此方法让良好实现的HTTP客户端来关闭连接。

source: With the settings above,
zh_cn: 按以上设置,

source: With this approach, the backslashes are only stripped by the Lua language parser and therefore only need to be escaped once each.
zh_cn: 使用这种方法，反斜线仅会被Lua语言解析器处理一次，因此不必多次转义.

source: With this in place, developers can adopt an edit-and-refresh approach.
zh_cn: 有了它，开发者可以采用象开发php那样修改-刷新即可

source: Within external script files, PCRE sequences presented as long-bracketed Lua string literals do not require modification.
zh_cn: 在外部脚本文件里，用双方括号表示的Lua字符串不需要作修改。.

source: Writes argument values into the nginx <code>error.log</code> file with the <code>ngx.NOTICE</code> log level.
zh_cn: 将参数值以<code>ngx.NOTICE</code>级别写入nginx <code>error.log</code> 文件.

source: Yields the executation of the current user Lua coroutine.
zh_cn: 挂起当前Lua coroutine的执行.

source: You always need to check the <code>res.truncated</code> boolean flag to see if <code>res.body</code> contains truncated data.
zh_cn: 你总是需要检查 <code>res.truncated</code> boolean 标记来确认 <code>res.body</code> 是否包含被截断的数据.

source: You can also initialize the [[#lua_shared_dict|lua_shared_dict]] shm storage at this phase.
zh_cn: 也可以在这个阶段对 [[#lua_shared_dict|lua_shared_dict]] 共享存储进行初始化。

source: You can call coroutine.status() and coroutine.yield() on the "light thread" coroutines.
zh_cn: 你可以对"轻量线程"coroutine调用 coroutine.status() 和 coroutine.yield() .

source: You can forcibly update the Nginx time cache by calling [[#ngx.update_time|ngx.update_time]] first.
zh_cn: 可以先用[[#ngx.update_timengx.update_time]]强制刷新Nginx时间缓存.

source: You can specify the optional <code>no_request_line</code> argument as a <code>true</code> value to exclude the request line from the result.
zh_cn: 要从结果中去掉请求行，可以将可选的 <code>no_request_line</code> 参数设为 <code>true</code> .

source: You must call [[#ngx.thread.wait|ngx.thread.wait]] to wait for those "light thread" to terminate before quitting the "world".
zh_cn: 要退出整个"世界"， 你必须调用 [[#ngx.thread.wait|ngx.thread.wait]] 来等待这些 "轻量线程" 结束.

source: You should be very careful about potential security vulnerabilities in your Lua code registered in this context because the Nginx master process is often run under the <code>root</code> account.
zh_cn: 要非常小心避免Lua代码中潜在的安全漏洞，因为Nginx主进程经常用 <code>root</code> 帐号来运行.

source: [http://openresty.org The ngx_openresty bundle] associated with this module comes with a set of companion Nginx modules and Lua libraries that provide interfaces with these data storage mechanisms.
zh_cn: 与本模块紧密联系的[http://openresty.org The ngx_openresty 包] 带有一系列 Nginx modules 和 Lua 库可以提供与这些数据存储机制交互的方法.

source: a anchored mode (only match from the beginning)
zh_cn: a 锚模式(仅从头部开始匹配)

source: an array-like Lua table.
zh_cn: 数组型的 Lua table.

source: and old <code>Foo</code> headers will be overridden if there is any.
zh_cn: 如果之前设置了 <code>Foo</code> 头，旧的值将被覆盖.

source: and then accessing it from <code>nginx.conf</code>:
zh_cn: 然后在 <code>nginx.conf</code> 中访问它:

source: assuming memcached (or something else) is listening on the unix domain socket file <code>/tmp/memcached.sock</code>.
zh_cn: 假设 memcached (或其它的什么东西) 正监听 unix domain socket 文件<code>/tmp/memcached.sock</code>.

source: assuming the datagram service is listening on the unix domain socket file <code>/tmp/some-datagram-service.sock</code> and the client socket will use the "autobind" feature on Linux.
zh_cn: 假设数据报服务监听的是 unix domain socket 文件<code>/tmp/some-datagram-service.sock</code> 客户端socket会使用Linux的 "自动绑定" 功能.

source: at least PCRE 8.12.
zh_cn: 至少PCRE 8.12版本.

source: because <code>if</code> runs ''before'' [[#rewrite_by_lua|rewrite_by_lua]] even if it is placed after [[#rewrite_by_lua|rewrite_by_lua]] in the config.
zh_cn: 因为 <code>if</code> 虽然写在[[#rewrite_by_luarewrite_by_lua]]之后，但还是在 [[#rewrite_by_lua|rewrite_by_lua]] ''之前''执行。

source: because <code>set $a 12</code> and <code>set $b ""</code> run ''before'' [[#rewrite_by_lua|rewrite_by_lua]].
zh_cn: 因为<code>set $a 12</code> 和 <code>set $b ""</code> 在[[#rewrite_by_luarewrite_by_lua]] ''之前'' 执行 .

source: can be coded as
zh_cn: 可以写成

source: can be coded in Lua as
zh_cn: 可以用Lua写成

source: can be coded in Lua like this:
zh_cn: 可以用Lua这样写:

source: can be implemented in ngx_lua as:
zh_cn: 可以用 ngx_lua 这样实现:

source: d enable the DFA mode (or the longest token match semantics).
zh_cn: d 打开 DFA 模式 (最长字元匹配语义).

source: first introduced in ngx_lua v0.3.1rc30.
zh_cn: 在 ngx_lua v0.3.1rc30 版本中引入.

source: first introduced in ngx_lua v0.8.1.
zh_cn: 在 ngx_lua v0.8.1 版本中引入.

source: for example,
zh_cn: 例如,

source: for optimum performance,
zh_cn: 为了最优的性能,

source: gives
zh_cn: 输出

source: gives something like this:
zh_cn: 输出象这样:

source: gives the output
zh_cn: 结果是

source: i case insensitive mode (similar to Perl's /i modifier)
zh_cn: i 大小写无关模式(类似于Perl的 /i 修饰符)

source: is equivalent to
zh_cn: 等价于

source: is equivalent to the following Lua code
zh_cn: 等价于以下Lua代码

source: j enable PCRE JIT compilation, this requires PCRE 8.21+ which
zh_cn: j 打开PCRE JIT编译, 需要带有--enable-jit选项编译的 PCRE 8.21+

source: local regex = "\d+" -- THIS IS WRONG!!
zh_cn: local regex = "\d+" -- 这是错误的!!

source: m multi-line mode (similar to Perl's /m modifier)
zh_cn: m 多行模式(类似于Perl /m 修饰符)

source: modifications of the Nginx variables in the subrequest will affect the current (parent) request.
zh_cn: 在子请求中修改nginx变量将影响到当前（父）请求.

source: modifications of the nginx variables in the subrequest will not affect the current (parent) request.
zh_cn: 在子请求中修改nginx变量不会影响当前（父）请求.

source: ngx.HTTP_COPY (added in the v0.8.2 release)
zh_cn: ngx.HTTP_COPY ( v0.8.2 版本引入)

source: ngx.HTTP_LOCK (added in the v0.8.2 release)
zh_cn: ngx.HTTP_LOCK ( v0.8.2 版本引入)

source: ngx.HTTP_MKCOL (added in the v0.8.2 release)
zh_cn: ngx.HTTP_MKCOL ( v0.8.2 版本引入)

source: ngx.HTTP_MOVE (added in the v0.8.2 release)
zh_cn: ngx.HTTP_MOVE ( v0.8.2 版本引入)

source: ngx.HTTP_OPTIONS (added in the v0.5.0rc24 release)
zh_cn: ngx.HTTP_OPTIONS ( v0.5.0rc24 版本引入)

source: ngx.HTTP_PATCH (added in the v0.8.2 release)
zh_cn: ngx.HTTP_PATCH ( v0.8.2 版本引入)

source: ngx.HTTP_PROPFIND (added in the v0.8.2 release)
zh_cn: ngx.HTTP_PROPFIND ( v0.8.2 版本引入)

source: ngx.HTTP_PROPPATCH (added in the v0.8.2 release)
zh_cn: ngx.HTTP_PROPPATCH ( v0.8.2 版本引入)

source: ngx.HTTP_TRACE (added in the v0.8.2 release) </geshi>
zh_cn: ngx.HTTP_TRACE ( v0.8.2 版本引入)</geshi>

source: ngx.HTTP_UNLOCK (added in the v0.8.2 release)
zh_cn: ngx.HTTP_UNLOCK ( v0.8.2 版本引入)

source: ngx.arg[2] = true -- new eof
zh_cn: ngx.arg[2] = true -- 新的 eof

source: ngx.eof() -- descent HTTP client will close the connection at this point
zh_cn: ngx.eof() -- 良好实现的HTTP客户端将在此时关闭连接

source: ngx.req.append_body(chunk) -- each chunk can be 4KB
zh_cn: ngx.req.append_body(chunk) -- 每一块可以是 4KB

source: ngx.req.init_body(128 * 1024) -- buffer is 128KB
zh_cn: ngx.req.init_body(128 * 1024) -- 缓冲区大小128KB

source: ngx.var.diff = a - b; -- write to $diff directly
zh_cn: ngx.var.diff = a - b; -- 直接写入 $diff

source: ngx_lua - Embed the power of Lua into Nginx
zh_cn: ngx_lua - 在Nging中嵌入强大的Lua

source: o compile-once mode (similar to Perl's /o modifier),
zh_cn: o 编译一次模式 (类似于 Perl /o 修饰符),

source: or
zh_cn: 或

source: or a Lua table holding the query arguments' key-value pairs, as in
zh_cn: 或存有请求参数名－值对的 Lua table, 如

source: or equivalently,
zh_cn: 或等价的,

source: or use Lua's syntactic sugar for method calls:
zh_cn: 或使用Lua方法调用的语法糖:
